Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་མ་རྫོགས། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: As long as the applications of mindfulness have not been perfected, as long as the correct exertions, the supports for miraculous ability, the faculties, the powers, the seven branches of enlightenment, and the noble eightfold path have not been perfected, and as long as the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas have not been perfected, they will not pass into final nirvāṇa prematurely.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་མ་རྫོགས་པར་བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ། །དེ་ཅིའི་སླ
en: If one were to ask why, it is because those aspirations are not aspirations, those applications of mindfulness are not applications of mindfulness; those correct exertions, supports for miraculous ability, faculties, powers, and branches of enlightenment; that noble eightfold path; and those truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, eight aspects of liberation, nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, gateways of the meditative stabilities and dhāraṇīs, ten powers of the tathāgatas, four fearlessnesses, four kinds of exact knowledge, and eighteen distinct qualities of the buddhas are not the eighteen distinct qualities of the buddhas [and so forth].

source: ད་དུ་ཞེ་ན། འདི་ལྟར་སྨོན་ལམ་རྣམས་ནི་སྨོན་ལམ་མ་ལགས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ལགས། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མ་ལགས་ཏེ། དེ་དག་ནི་ཆོས་ཀྱང་མ་ལགས། ཆོས་མ་ལགས་པ་ཡང་མ་ལགས་སོ།
en: They are not anything at all, nor are they not anything at all. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་གང་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་བཟུང་བའི་སླད་དུ། གཟུགས་ཡོངས་སུ་མི་འཛིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པ་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་གཟུང་བའི་སླད་དུ། ཡང་དག་པའི་མཐའི་བར་དུ་ཡོངས་སུ་མི་འཛིན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Blessed Lord, this nonappropriation of physical forms, and this nonappropriation of feelings, perceptions, formative predispositions, and consciousness, due to the fact that no phenomena can be grasped, and this nonappropriation of [unconditioned phenomena], up to and including the very limit of reality, due to the fact that no phenomena can be grasped, is the perfection of wisdom of bodhisattva great beings. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གང་གི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཅི་ཞིག །
en: Moreover, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should investigate what is this perfection of wisdom, whose is this perfection of wisdom, how is this perfection of wisdom, and for what purpose is this perfection of wisdom.

source: ཅིའི་ཕྱིར་ན་དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེས་ཡོངས་སུ་བརྟག་པར་བགྱི་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་ཅིང་ཉེ་བར་སེམས་པའི་ཚེ། ཆོས་གང་མེད་ཅིང་མི་དམིགས་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ་ཞེས་གལ་ཏེ། དེ་ལྟར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན།
en: When bodhisattva great beings practice the perfection of wisdom, if, while making this investigation and pondering it, they observe that the nonexistence and nonapprehensibility of anything at all denote the perfection of wisdom, why, one might ask, do they make this observation?

source: དེ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ཞེས་བྱ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་མ་མཆིས། མི་དམིགས་སོ།
en: Blessed Lord, it is because all phenomena are nonexistent and nonapprehensible.

source: །གལ་ཏེ་འདི་ལྟར་ཆོས་གང་ཡོད་པ་མ་ཡིན་ཞིང་མི་དམིགས་པ་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནམ་ཞེས་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས།
en: But if they practice while wondering whether this nonexistence and nonapprehensibility of anything at all is the perfection of wisdom, then they are not practicing the perfection of wisdom.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་གང་རྣམས་མེད་ཅིང་མི་དམིགས་པ་ཡིན། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་།
en: Then, the venerable Śāradvatīputra addressed the venerable Subhūti: “Venerable Subhūti, what are the phenomena that do not exist and that are nonapprehensible?” {

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་ཅིང་མི་དམིགས་སོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་མེད་ཅིང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་
en: Dt.136} “Venerable Śāradvatīputra,” replied Subhūti, “owing to the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of both external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of nonapprehensibility, the emptiness of all intrinsic defining characteristics, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities—owing to all these—the perfection of wisdom is nonexistent and nonapprehensible, and also the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are nonexistent and nonapprehensible. “

source: དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། གཟུགས་མེད་ཅིང་མི་དམིགས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་ཅིང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of both external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of nonapprehensibility, the emptiness of all intrinsic defining characteristics, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities that physical forms are nonexistent and nonapprehensible, and that feelings, perceptions, formative predispositions, and consciousness are nonexistent and nonapprehensible.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་།
en: Venerable Śāradvatīputra, even the emptiness of internal phenomena is nonexistent and nonapprehensible. “

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་ཅིང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་མེད་ཅིང་མི་དམིགས་སོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མེད་ཅིང་མི་དམིགས་སོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of both external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of nonapprehensibility, the emptiness of all intrinsic defining characteristics, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities that the sense fields, the sensory elements, and the links of dependent origination are nonexistent and nonapprehensible. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མེད་ཅིང་མི་དམིགས་སོ། །ནང་སྟོང་པ་ཉིད་དང་།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that the perfections are nonexistent and nonapprehensible, that the thirty-seven factors conducive to enlightenment are nonexistent and nonapprehensible, and that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are nonexistent and nonapprehensible. “

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མེད་ཅིང་མི་དམིགས་སོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ། །ནང་སྟོང་པ་ཉིད་དང་།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that the fruit of entering the stream to nirvāṇa is nonexistent and nonapprehensible, and that the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, the fruit of arhatship, the fruit of individual enlightenment, knowledge of the path, and all-aspect omniscience are nonexistent and nonapprehensible. “

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། དེ་བཞིན་ཉིད་མེད་ཅིང་མི་དམིགས་སོ། །ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that the real nature is nonexistent and nonapprehensible, and that reality, the realm of phenomena, the abiding nature of reality, the maturity of all phenomena, and the very limit of reality are nonexistent and nonapprehensible. “

source: ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་མེད་ཅིང་མི་དམིགས་སོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། རྒྱུན་དུ་ཞུགས་པ་ཡང་མེད་ཅིང་མི་དམིགས་སོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་།
en: Venerable Śāradvatīputra, it is owing to the emptiness of internal phenomena and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that those entering the stream to nirvāṇa are nonexistent and nonapprehensible, and that those destined for only one more rebirth, those who will no longer be subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and buddhas are also nonexistent and nonapprehensible. “

source: རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་ཀྱང་མེད་ཅིང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་དམིགས་སུ་མེད་པའི་ཕྱིར། ནང་སྟོང་པ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, since internal phenomena are nonapprehensible, the emptiness of internal phenomena is nonexistent and nonapprehensible.

source: །ཕྱི་དམིགས་སུ་མེད་པའི་ཕྱིར། ཕྱི་སྟོང་པ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ།
en: Since external phenomena are nonapprehensible, the emptiness of external phenomena is nonexistent and nonapprehensible.

source: །ཕྱི་ནང་དམིགས་སུ་མེད་པའི་ཕྱིར། ཕྱི་ནང་སྟོང་པ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ།
en: Since external and internal phenomena are nonapprehensible, the emptiness of both external and internal phenomena is nonexistent and nonapprehensible.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དམིགས་སུ་མེད་པའི་ཕྱིར། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མེད་ཅིང་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Since [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonapprehensible, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonexistent and nonapprehensible. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་དེ་ལྟར་རྟོག་ཅིང་སེམས་པ་དང་། དེ་ལྟར་རྟོག་ཅིང་སེམས་པའི་ཚེ། སེམས་ཞུམ་པ་མེད་ཅིང་ཡོངས་སུ་ཞུམ་པ་མེད་ལ། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ན།
en: Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, if they investigate and ponder accordingly, and if, when they investigate and ponder in that manner, they are not disheartened, not intimidated, not afraid, not terrified, and will not be terrified, one should know that these bodhisattva great beings will not be separated from the perfection of wisdom.” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་ཤེས་པར་བྱའོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་ཤེས་པར་བྱ། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Venerable Subhūti, why should one know that these bodhisattva great beings will not be separated from the perfection of wisdom?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། གཟུགས་ནི་གཟུགས་ཀྱི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Venerable Śāradvatīputra,” replied the venerable Subhūti, “physical forms are without the inherent nature of physical forms, and this is correctly and definitively cognized when bodhisattva great beings practice the perfection of wisdom.

source: །ཚོར་བ་ནི་ཚོར་བའི་རང་བཞིན་དང་བྲལ་བ། འདུ་ཤེས་ནི་འདུ་ཤེས་ཀྱི་རང་བཞིན་དང་བྲལ་བ། འདུ་བྱེད་ནི་འདུ་བྱེད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པའི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ནི། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རང་བཞིན་དང་བྲལ་བ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་རང་བཞིན་དང་བྲལ་བ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རང་བཞིན་དང་བྲལ་བ། ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་བ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Feelings are without the inherent nature of feelings, perceptions are without the inherent nature of perceptions, formative predispositions are without the inherent nature of formative predispositions, and consciousness is without the inherent nature of consciousness, and this is correctly and definitively cognized when bodhisattva great beings practice the perfection of wisdom. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། རྒྱུན་དུ་ཞུགས་པ་ནི་རྒྱུན་དུ་ཞུགས་པའི་རང་བཞིན་དང་བྲལ་བ། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། དེ་བཞིན་ཉིད་ནི་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་དང་བྲལ་བ། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་།
en: Venerable Śāradvatīputra, the sense fields, the sensory elements, and the links of dependent origination are without the inherent nature of the links of dependent origination [and so forth]; the perfection of generosity is without the inherent nature of the perfection of generosity; the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are without the inherent nature of the perfection of wisdom [and so forth]; the emptiness of internal phenomena is without the inherent nature of the emptiness of internal phenomena; [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are without the inherent nature of the emptiness of the essential nature of nonentities [and so forth]; the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are all without the inherent nature of the eighteen distinct qualities of the buddhas [and so forth]; entering the stream to nirvāṇa is without the inherent nature of entering the stream to nirvāṇa; having one more rebirth, no longer being subject to rebirth, arhatship, individual enlightenment, and [the other attainments], up to and including all-aspect omniscience, are without the inherent nature of all-aspect omniscience [and so forth]; the real nature is without the inherent nature of the real nature; and the unmistaken real nature, the unalienable real nature, reality, the realm of phenomena, the abiding nature of reality, the maturity of all phenomena, and the very limit of reality are all without the inherent nature of the very limit of reality [and so forth].

source: ཡང་དག་པའི་མཐའ་ནི་ཡང་དག་པའི་མཐའ་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: This is correctly and definitively cognized by bodhisattva great beings when they practice the perfection of wisdom. “

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་ཤེས་པར་བྱའོ། །སྨྲས་པ།
en: Venerable Śāradvatīputra, it is for this reason that one should know that bodhisattva great beings are not separated from the perfection of wisdom.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གཟུགས་ཀྱི་རང་བཞིན་ནི་ཇི་ལྟ་བུ།
en: Venerable Subhūti, what is the inherent nature of physical forms?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་རང་བཞིན་ནི་ཇི་ལྟ་བུ།
en: What is the inherent nature of feelings, perceptions, formative predispositions, and consciousness? {

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རང་བཞིན་ནི་ཇི་ལྟ་བུ།
en: Dt.137} What is the inherent nature of the sense fields, the sensory elements, and the links of dependent origination?

source: ཡང་དག་པའི་མཐའི་བར་གྱི་རང་བཞིན་ནི་ཇི་ལྟ་བུ།
en: What is the inherent nature of [unconditioned phenomena], up to and including the very limit of reality?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “the inherent nature of physical forms is nonentity.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ།
en: The inherent nature of feelings, perceptions, formative predispositions, and consciousness is nonentity.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ།
en: The inherent nature of the sense fields, the sensory elements, and the links of dependent origination is nonentity.

source: །ཡང་དག་པའི་མཐའི་བར་གྱི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའོ།
en: The inherent nature of [unconditioned phenomena], up to and including the very limit of reality, is nonentity. “
